<?php
/**
 * @desc 错误字典
 *
 */
class Err_Map{
    const ERRMAP = array(
        0     => '',

        /**
         * 用户类错误提示码
         */
        1001  => '请通过正常渠道提交',
        1002  => '用户名或密码不能为空',
        1003  => '用户查找失败',
        1004  => '密码错误',
        1005  => '用户名已存在',
        1006  => '密码太短，请输入最低8位的密码',
        1007  => '注册失败，写入数据库失败',

        /**
         * 文章类错误提示码
         *
         */
        2000  => '需要管理员权限',
        2001  => '请通过正常渠道提交',
        2002  => '没填写完整',
        2003  => '缺少必要的参数',
        2004  => '找不到文章,请确认是否有该文章',
        2005  => '找不到分类信息-',
        2006  => '操作文章数据表失败,errinfo:',
        2007  => '缺少必要的ID参数',
        2008  => '更新文章状态失败',
        2009  => '查询失败',
        2010  => '获取分类信息失败',
        2011  => '获取文章列表失败, errinfo',
        2012  => '删除数据失败',

        /**
         * 邮箱发送错误提示码
         */
        3001  => '请通过正常渠道提交',
        3002  => '用户id，邮件title，邮件内容不能为空',
        3003  => '邮箱信息查找失败',
        3004  => '邮箱不合法',

        /**
         * 短信发送错误提示码
         */
        4001  => '请通过正常渠道提交',
        4002  => '用户Id，短信内容不能为空',
        4003  => '用户手机号信息查找失败',
        4004  => '手机号不符合规定',
        4005  => '发送失败',
        4006  => '消息发送成功，数据插入失败',

        /**
         * IP地址转详细地址错误提示码
         */
        5001  => 'IP地址不正确',

        /**
         * 微信支付错误提示码
         */
        6001  => '请传递正确的商品ID',
        6002  => '请先登录后操作',
        6003  => '',
        6004  => '找不到这件商品',
        6005  => '商品过期',
        6006  => '商品没有库存',
        6007  => '创建订单失败',
        6008  => '更新库存失败',
        6009  => '请传递正确的订单ID',
        6010  => '',
        6011  => '找不到订单信息',
        6012  => '找不到商品信息',
    );

    public static function get($code){
        if(isset(self::ERRMAP[$code])){
            return array('errno'=>(0-$code), 'errmsg'=>self::ERRMAP[$code]);
        }
        return array('errno'=>(0-$code), 'errmsg'=>"没有定义该类错误码");

    }
}
