<?php
/**
 * @desc 错误字典
 *
 */
class Err_Map{
    const ERRMAP = array(
        0     => '',
        /**
         * 用户类错误提示码
         */
        1001  => '请通过正常渠道提交',
        1002  => '用户名或密码不能为空',
        1003  => '用户查找失败',
        1004  => '密码错误',
        1005  => '用户名已存在',
        1006  => '密码太短，请输入最低8位的密码',
        1007  => '注册失败，写入数据库失败',
        /**
         * 文章类错误提示码
         *
         */
        2000  => '需要管理员权限',
        2001  => '请通过正常渠道提交',
        2002  => '没填写完整',
        2003  => '缺少必要的参数',
        2004  => '找不到文章,请确认是否有该文章',
        2005  => '找不到分类信息-',
        2006  => '操作文章数据表失败,errinfo:',
        2007  => '缺少必要的ID参数',
        2008  => '更新文章状态失败',
        2009  => '查询失败',
        2010  => '获取分类信息失败',
        2011  => '获取文章列表失败, errinfo',
        2012  => '删除数据失败',
    );

    public static function get($code){
        if(isset(self::ERRMAP[$code])){
            return array('errno'=>(0-$code), 'errmsg'=>self::ERRMAP[$code]);
        }
        return array('errno'=>(0-$code), 'errmsg'=>"没有定义该类错误码");

    }
}
